<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%>
<fmt:setLocale value="${locale}" scope="session"/>
<fmt:setBundle basename="pageContent" var="rb"/>
<!DOCTYPE html>
<html>

<head>
    <meta http-equiv='Content-Type' content='text/html; charset=UTF-8' />
    <link href="css/mainC.css" rel="stylesheet">
    <link href="css/cssReset.css" rel="stylesheet">
    <link href="css/regR.css" rel="stylesheet">
    <title>InstaGod</title>
</head>

<body >

<c:import url="/jsp/common/parts/guestNavBar.jsp"/>

<div class="center-box">
    <div class="header">
        <h1><fmt:message key="buttom.registrationPage.registration" bundle="${rb}"/></h1>
    </div>
    <div class="middlePart">
        <div class="formContenet">
        <form class="logInForm" name="form1" method="post" action="controller">
            <input type="hidden" name="command" value="registration">
                 <div class="inputEmail">
                    <label><fmt:message key="registrationPage.text.email" bundle="${rb}"/></label>
                    <input type="text" name="email" placeholder="<fmt:message key="registrationPage.text.email" bundle="${rb}"/>">
                </div>
                <div class="inputName">
                    <label ><fmt:message key="registrationPage.text.UserName" bundle="${rb}"/></label>
                    <input type="text" name="login" placeholder="<fmt:message key="registrationPage.text.UserName" bundle="${rb}"/>">
                </div>
                <div class="inputPassword">
                    <label ><fmt:message key="registrationPage.text.Password" bundle="${rb}"/></label>
                    <input type="password" name="password" placeholder="<fmt:message key="registrationPage.text.Password" bundle="${rb}"/>">
                </div>
                <div class="checkBoxReg">
                    <input type="checkbox" name="checkBoxRules" value="checked">
                    <label>
                        <span ><fmt:message key="registrationPage.text.rules1" bundle="${rb}"/></span>
                    <a class="regPageRules" ><fmt:message key="registrationPage.text.rules2" bundle="${rb}"/></a>
                        <span ><fmt:message key="registrationPage.text.rules3" bundle="${rb}"/></span>
                    <a class="regPagePolicy"><fmt:message key="registrationPage.text.rules4" bundle="${rb}"/></a>
                    </label>
                </div>
                <div class="buttomContener">
                    <input type="submit" value="<fmt:message key="buttom.registrationPage.registration" bundle="${rb}"/>">
                </div>
        </form>
        </div>

    <div class="fbvk">
        <div class="fbvkOR"><span><fmt:message key="registrationPage.text.OR" bundle="${rb}"/></span></div>
        
        <div class="fbvkLinks">
        <h2><fmt:message key="registrationPage.text.login" bundle="${rb}"/></h2>
        <ul>
        <li><a>FaceBook</a></li>
        <li><a>Twitter</a></li>
        <li><a>Google</a></li>
        <li><a>VK</a></li>
        </ul>
        </div>

    </div>
        <div class="registrationPageErrorMessage">${requestScope.errorMassage}</div>
    </div>

</div>
<div class="regRules">
    <a class="regRulesClose" >Закрыть</a>
    <label class="regRulesMain">Пользовательское соглашение</label>
    <div class="regRulesText">

        Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов сайта www.        (далее — «Сайт»).

        <h2>1.Общие условия</h2>

        1.1. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.<br>

        1.2. Настоящее Соглашение является публичной офертой. Получая доступ к материалам Сайта Пользователь считается присоединившимся к настоящему Соглашению.<br>

        1.3. Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения новой версии Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов Сайта.<br>

        <h2>2. Обязательства Пользователя</h2>

        2.1. Пользователь соглашается не предпринимать действий, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных правах, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.<br>

        2.2. Использование материалов Сайта без согласия правообладателей не допускается (статья 1270 Г.К РФ). Для правомерного использования материалов Сайта необходимо заключение лицензионных договоров (получение лицензий) от Правообладателей.<br>

        2.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна (подпункт 1 пункта 1 статьи 1274 Г.К РФ).<br>

        2.4. Комментарии и иные записи Пользователя на Сайте не должны вступать в противоречие с требованиями законодательства Российской Федерации и общепринятых норм морали и нравственности.<br>

        2.5. Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на сайте.<br>

        2.6. Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.<br>

        2.7. Пользователь принимает положение о том, что все материалы и сервисы Сайта или любая их часть могут сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с такой рекламой.<br>

        <h2>3. Прочие условия</h2>

        3.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации.<br>

        3.2. Ничто в Соглашении не может пониматься как установление между Пользователем и Администрации Сайта агентских отношений, отношений товарищества, отношений по совместной деятельности, отношений личного найма, либо каких-то иных отношений, прямо не предусмотренных Соглашением.<br>

        3.3. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения.<br>

        3.4. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы Сайта.<br>

        Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и безусловно принимает их.</div>
</div>
<div class="regPolicy">
    <a class="regPolicyClose" >Закрыть</a>
    <label class="regPolicyMain">Политика конфиденциальности</label>
    <div class="regPolicyText">Политика конфиденциальности



        Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт www.onliner.by, может получить о Пользователе во время использования сайта.<br>

        <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2><br>
        1.1. В настоящей Политике конфиденциальности используются следующие термины:<br>
        1.1.1. «Сайт» – сайт www.InstaGod<br>
        1.1.2. «Администрация Сайта» – уполномоченные сотрудники по управлению сайтом, действующие от имени Общества с ограниченной ответственностью «Онлайнер», которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.<br>
        1.1.3. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).<br>
        1.1.4. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.<br>
        1.1.5. «Конфиденциальность персональных данных» - обязательное для соблюдения Администрацией Сайта или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.<br>
        1.1.6. «Пользователь Сайта (далее Пользователь)» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.<br>
        1.1.7. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.<br>
        1.1.8. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.<br>

        <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2><br>
        2.1. Использование Пользователем Сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.<br>
        2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование Сайта.<br>
        2.3. Настоящая Политика конфиденциальности применяется только к Сайту. Сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте.<br>
        2.4. Администрация Сайта не проверяет достоверность персональных данных, предоставляемых Пользователем Сайта.<br>

        <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2><br>
        3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации Сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации Сайта при регистрации на Сайте или при совершении иных действий посредством Сайта.<br>
        3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы или совершения иных действий на Сайте, и могут включать в себя следующую информацию:<br>
        3.2.1. фамилию, имя, отчество Пользователя;<br>
        3.2.2. контактный телефон Пользователя;<br>
        3.2.3. адрес электронной почты (e-mail);<br>
        3.2.4. товары, которые сравнивает или выбирает Пользователь;<br>
        3.2.5. место жительство Пользователя.<br>
        3.3. Сайт защищает данные, которые автоматически передаются при посещении страниц, на которых установлен статистический скрипт системы («пиксель»):<br>
        - IP адрес;<br>
        - информация из cookies;<br>
        - информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);<br>
        - время доступа;<br>
        - адрес страницы, на которой расположен рекламный блок;<br>
        - реферер (адрес предыдущей страницы).<br>
        3.3.1. Отключение cookies может повлечь невозможность доступа к частям Сайта, требующим авторизации.<br>
        3.3.2. Сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.<br>
        3.4. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.<br>

        <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h2><br>
        4.1. Персональные данные Пользователя Администрация Сайта может использовать в целях:<br>
        4.1.1. Идентификации Пользователя, зарегистрированного на Сайте.<br>
        4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта.<br>
        4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг, обработка запросов и заявок от Пользователя.<br>
        4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.<br>
        4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.<br>
        4.1.6. Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи.<br>
        4.1.7. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта.<br>
        4.1.8. Предоставления Пользователю с его согласия, новостной рассылки и иных сведений от имени Сайта.<br>
        4.1.9. Осуществления рекламной деятельности с согласия Пользователя.<br>
        4.1.10. Предоставления доступа Пользователю на сайты или сервисы партнеров Сайта с целью получения продуктов, обновлений и услуг.<br>

        <h2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2><br>
        5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.<br>
        5.2. Пользователь соглашается с тем, что Администрация Сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте.<br>
        5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Республики Беларусь только по основаниям и в порядке, установленным законодательством Республики Беларусь.<br>
        5.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.<br>
        5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.<br>
        5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.<br>

        <h2>6. ОБЯЗАТЕЛЬСТВА СТОРОН</h2><br>
        6.1. Пользователь обязан:<br>
        6.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом.<br>
        6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.<br>
        6.2. Администрация сайта обязана:<br>
        6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.<br>
        6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.<br>
        6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.<br>
        6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.<br>

        <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2><br>
        7.1. Администрация Сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Беларусь, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.<br>
        7.2. В случае утраты или разглашения Конфиденциальной информации Администрация Сайта не несёт ответственность, если данная конфиденциальная информация:<br>
        7.2.1. Стала публичным достоянием до её утраты или разглашения.<br>
        7.2.2. Была получена от третьей стороны до момента её получения Администрацией Сайта.<br>
        7.2.3. Была разглашена с согласия Пользователя.<br>

        <h2>8. РАЗРЕШЕНИЕ СПОРОВ</h2><br>
        8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Администрацией Сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).<br>
        8.2 .Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.<br>
        8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Республики Беларусь.<br>
        8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта применяется действующее законодательство Республики Беларусь.<br>

        <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2><br>
        9.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.<br>
        9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.<br>
        9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует направлять на электронный адрес Администрации Сайта: info@onliner.by</div>
</div>
<c:import url="/jsp/common/parts/links.jsp"/>
</body>
</html>